> This looks fine to me, I guess I'm confused how our tests were passing if this was causing such a problem. Is there an alternative way to create buckets with labels that doesn't hit the inconsistent plan?

Sadly i'm missing the required Terraform-internal knowledge to give you a helpful answer here, but this bug is kinda strange.

This works with the latest provider (4.64.0):

```
resource "google_storage_bucket" "bucket" {
  name          = "onion-super-bucket"
  location      = "EU"
  force_destroy = true
  labels = {
    foo = "bar"
  }
}
```

As soon as you add a label with a derived value it fails since 4.40.0:

```
resource "random_string" "this" {
  length  = 3
  upper   = false
  numeric = false
  special = false
}

resource "google_storage_bucket" "bucket" {
  name          = "onion-super-bucket"
  location      = "EU"
  force_destroy = true
  labels = {
    two = random_string.this.result
    foo = "bar"
  }
}
```

```
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = (known after apply)
      + project                     = "[REDACTED]"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # random_string.this will be created
  + resource "random_string" "this" {
      + id          = (known after apply)
      + length      = 3
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_string.this: Creating...
random_string.this: Creation complete after 0s [id=msg]
╷
│ Error: Provider produced inconsistent final plan
│ 
│ When expanding the plan for google_storage_bucket.bucket to include new values learned so far during apply, provider "registry.terraform.io/hashicorp/google" produced an
│ invalid new value for .labels: was null, but now cty.MapVal(map[string]cty.Value{"foo":cty.StringVal("bar"), "two":cty.StringVal("msg")}).
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
```

